app/controllers/application_controller.rb

SELECT "pasiens".* FROM "pasiens" WHERE "pasiens"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def logged_in_user
    if decoded_token
      user_id = decoded_token[0]['user_id']
      @user = Pasien.find_by(id: user_id)