app/controllers/articles_controller.rb

  def show
    articles = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]