app/controllers/articles_controller.rb

  def index
    articles = Article.page(params[:page]).per(params[:per_page])

    render json: {
        data: articles,
        meta: {
            count: articles.count, # menghitung item tiap page
---
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "articles" LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]
SELECT "articles".* FROM "articles"

  def create
      params[:penulis] = @user.id
      article = Article.create(create_params)
---
INSERT INTO "articles" ("judul", "konten", "penulis", "foto", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["judul", "artikel 06"], ["konten", "konten 06"], ["penulis", "1"], ["foto", "artikel06/url"], ["created_at", "2021-12-09 08:46:04.930514"], ["updated_at", "2021-12-09 08:46:04.930514"]]

  def show
    articles = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def search
    articles = Article.where('judul ILIKE :search OR konten ILIKE :search OR penulis ILIKE :search', search: "%#{params[:search]}%")
---
SELECT "articles".* FROM "articles" WHERE (judul ILIKE '%06%' OR konten ILIKE '%06%' OR penulis ILIKE '%06%')