app/controllers/doctors_controller.rb

SELECT COUNT(*) FROM (SELECT 1 AS one FROM "doctors" LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]
SELECT "doctors".* FROM "doctors" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
---
    def index
        doctors = Doctor.page(params[:page]).per(params[:per_page])

        render json: {
            data: doctors,
            meta: {
                count: doctors.count, # menghitung item tiap page

SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        doctors = Doctor.find(params[:id])

SELECT "doctors".* FROM "doctors" WHERE (nama ILIKE '%lam%' OR spesialis ILIKE '%lam%')
---
    def search
        doctors = Doctor.where('nama ILIKE :search OR spesialis ILIKE :search', search: "%#{params[:search]}%")