app/controllers/pasiens_controller.rb

SELECT "pasiens".* FROM "pasiens"
---
  def index
    pasiens = Pasien.all

SELECT "pasiens".* FROM "pasiens" WHERE "pasiens"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    pasien = Pasien.find(params[:id])

SELECT "pasiens".* FROM "pasiens" WHERE "pasiens"."email" = $1 LIMIT $2  [["email", "bella@gmail.com"], ["LIMIT", 1]]
---
  def login
    @user = Pasien.find_by(email: params[:email])