app/controllers/pasiens_controller.rb

SELECT "pasiens".* FROM "pasiens"
---
  def show
    pasiens = Pasien.all

INSERT INTO "pasiens" ("nama_depan", "nama_belakang", "email", "password_digest", "umur", "jenis_kelamin", "no_hp", "foto", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = Pasien.create(user_params)

SELECT "pasiens".* FROM "pasiens" WHERE "pasiens"."email" = $1 LIMIT $2  [["email", "raranayla@gmail.com"], ["LIMIT", 1]]
---
  def login
    @user = Pasien.find_by(email: params[:email])

SELECT "pasiens".* FROM "pasiens" WHERE "pasiens"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "pasiens" SET "nama_belakang" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "pasiens"."id" = $4  [["nama_belakang", "Nayla"], ["password_digest", "$2a$12$PD6.Om6jttpzmd8WnwMQuO5M/31lhyRVDEgvnYGXMfD7LS6oT1u0a"], ["updated_at", "2021-12-07 19:24:07.605738"], ["id", 5]]
---
  def update
    @user = Pasien.find(params[:id])

    @user.update(update_params)