app/controllers/passwords_controller.rb

SELECT "pasiens".* FROM "pasiens" WHERE "pasiens"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "351e8f7796e1f58e7a2d"], ["LIMIT", 1]]
---
    def index
      token = params[:token]
      user = Pasien.find_by(reset_password_token: token)

SELECT "pasiens".* FROM "pasiens" WHERE "pasiens"."email" = $1 LIMIT $2  [["email", "belladrahmatulia@gmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "pasiens" WHERE "pasiens"."email" = $1 AND "pasiens"."id" != $2 LIMIT $3  [["email", "belladrahmatulia@gmail.com"], ["id", 2], ["LIMIT", 1]]
---
    def forgot
        if params[:email].blank? # check if email is present
          return render json: {error: 'Email not present'}
        end

        user = Pasien.find_by(email: params[:email]) # if present find user by email

        if user.present?

SELECT "pasiens".* FROM "pasiens" WHERE "pasiens"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "6578020eedc522680c12"], ["LIMIT", 1]]
---
      def reset
        token = params[:token].to_s

        if params[:email].blank?
          return render json: {error: 'Token not present'}
        end

        user = Pasien.find_by(reset_password_token: token)

        if user.present? && user.password_token_valid?