app/controllers/schedules_controller.rb

    def index
        schedules = Schedule.select("nama, spesialis, schedule, status, schedules.id as id")
        .joins("JOIN doctors ON schedules.id_dokter = doctors.id").where("schedules.id_pasien = #{@user.id}")

        if schedules.present?
---
SELECT nama, spesialis, schedule, status, schedules.id as id FROM "schedules" JOIN doctors ON schedules.id_dokter = doctors.id WHERE (schedules.id_pasien = 2)
SELECT nama, spesialis, schedule, status, schedules.id as id FROM "schedules" JOIN doctors ON schedules.id_dokter = doctors.id WHERE (schedules.id_pasien = 1)

    def show
        schedule = Schedule.select("nama, spesialis, harga_konsul, lokasi, nik, profile_pasien, schedule, address, status, schedules.id as id")
        .joins("JOIN doctors ON schedules.id_dokter = doctors.id").where("schedules.id = #{params[:id]}")

        if schedule.present?
---
SELECT nama, spesialis, harga_konsul, lokasi, nik, profile_pasien, schedule, address, status, schedules.id as id FROM "schedules" JOIN doctors ON schedules.id_dokter = doctors.id WHERE (schedules.id = 4)
SELECT nama, spesialis, harga_konsul, lokasi, nik, profile_pasien, schedule, address, status, schedules.id as id FROM "schedules" JOIN doctors ON schedules.id_dokter = doctors.id WHERE (schedules.id = 1)

    def cancel
        schedule = Schedule.find(params[:id])
        schedule.update_attribute(:status, "cancel")
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "schedules" SET "status" = $1, "updated_at" = $2 WHERE "schedules"."id" = $3  [["status", "cancel"], ["updated_at", "2021-12-14 16:55:52.560916"], ["id", 1]]

    def show_today
        schedule = Schedule.select("nama, spesialis, harga_konsul, lokasi, nik, profile_pasien, schedule, address, status, schedules.id as id")
        .joins("JOIN doctors ON schedules.id_dokter = doctors.id")
        .where("schedules.id_pasien = #{@user.id} AND schedules.schedule = '#{Time.zone.now.beginning_of_day}'")

        if schedule.present?
---
SELECT nama, spesialis, harga_konsul, lokasi, nik, profile_pasien, schedule, address, status, schedules.id as id FROM "schedules" JOIN doctors ON schedules.id_dokter = doctors.id WHERE (schedules.id_pasien = 1 AND schedules.schedule = '2021-12-14 00:00:00 +0700')
SELECT "schedules".* FROM "schedules" WHERE "schedules"."schedule" = $1  [["schedule", "2021-12-15 18:00:00"]]

    def create
        start_consult = Schedule.where(schedule: DateTime.parse(params[:schedule])..DateTime.parse(params[:end_schedule]), id_dokter: params[:id_dokter])
        end_consult = Schedule.where(end_schedule: DateTime.parse(params[:schedule])..DateTime.parse(params[:end_schedule]), id_dokter: params[:id_dokter])

        if start_consult.present?
            render json: {
                data: "Please choose another day or time",
            }
        elsif end_consult.present?
            render json: {
                data: "Please choose another day or time",
            }
        else
            params[:id_pasien] = @user.id
            schedule = Schedule.create(create_params)
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."end_schedule" BETWEEN $1 AND $2  [["end_schedule", "2021-12-15 19:00:00"], ["end_schedule", "2021-12-15 20:30:00"]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."schedule" BETWEEN $1 AND $2 AND "schedules"."id_dokter" = $3  [["schedule", "2021-12-16 03:30:00"], ["schedule", "2021-12-16 05:00:00"], ["id_dokter", 3]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."schedule" = $1 AND "schedules"."end_schedule" = $2  [["schedule", "2021-12-16 01:00:00"], ["end_schedule", "2021-12-16 01:00:00"]]
INSERT INTO "schedules" ("id_pasien", "id_dokter", "schedule", "end_schedule", "profile_pasien", "nik", "address", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"