app/controllers/schedules_controller.rb

INSERT INTO "schedules" ("id_pasien", "id_dokter", "schedule", "profile_pasien", "nik", "address", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        params[:id_pasien] = @user.id
        schedule = Schedule.create(create_params)